Перем тзОбщееОписаниеТипов экспорт;
&НаКлиенте
Процедура Прочитать(Команда)
	

		ЧтениеXML = Новый ЧтениеXML;     
		ЧтениеXML.ОткрытьФайл("C:\Program Files (x86)\Bloody7\Bloody7\Data\Mouse\English\SLED\Standard8\Wave.ckAnimation");
		ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
Структура = ОбъектXDTOВСтруктуру(ОбъектXDTO);

//Для ч = 1 По Число(Структура.FrameCount) Цикл
//	
//    Позиция = Найти(Структура["Frame" + ч].ColorPicture, ",");
//    Пока Позиция > 0 Цикл
//        Подстрока = Лев(Строка, Позиция - 1);
//        Если Не ПустаяСтрока(Подстрока) Тогда
//            Результат.Добавить(Подстрока);
//        КонецЕсли;
//        Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
//        Позиция = Найти(Строка, Разделитель);
//    КонецЦикла;
////Сообщить();	
//КонецЦикла;
КонецПроцедуры


Функция ОбъектXDTOВСтруктуру(ОбъектXDTO, ПараметрыПреобразования = Неопределено) Экспорт

Структура = Новый Структура;
ТипОбъектаXDTO = ОбъектXDTO.Тип();

Для Каждого Свойство Из ОбъектXDTO.Свойства() Цикл

ИмяСвойства = Свойство.Имя;
ЗначениеСвойства = ОбъектXDTO[ИмяСвойства];

Если ТипЗнч(ЗначениеСвойства) = Тип("ОбъектXDTO") Тогда

Структура.Вставить(ИмяСвойства, ОбъектXDTOВСтруктуру(ЗначениеСвойства, ПараметрыПреобразования));

ИначеЕсли ТипЗнч(ЗначениеСвойства) = Тип("СписокXDTO") Тогда

Структура.Вставить(ИмяСвойства, Новый Массив);
Для Индекс = 0 По ЗначениеСвойства.Количество() - 1 Цикл

//ЭлементСписка = ЗначениеСвойства.Получить(Индекс);
//Если ТипЗнч(ЭлементСписка) = Тип("ОбъектXDTO") Тогда
//Структура[ИмяСвойства].Добавить(ОбъектXDTOВСтруктуру(ЭлементСписка, ПараметрыПреобразования));
//Иначе
//Структура[ИмяСвойства].Добавить(ЭлементСписка);
//КонецЕсли;

КонецЦикла;

Иначе

Структура.Вставить(ИмяСвойства, ЗначениеСвойства);

Если ПараметрыПреобразования <> Неопределено
И ПараметрыПреобразования.НайтиИдентификаторы
И Свойство.Тип = ПараметрыПреобразования.ТипUUID Тогда

РезультатПоиска = ПараметрыПреобразования.ТипыИдентификаторов[ТипОбъектаXDTO];
Если РезультатПоиска <> Неопределено
И РезультатПоиска.ИмяПоля = ИмяСвойства Тогда
ПараметрыПреобразования.Идентификаторы[РезультатПоиска.ИмяТаблицы].Вставить(ЗначениеСвойства, РезультатПоиска.ПустоеЗначение);
КонецЕсли;

КонецЕсли;

КонецЕсли;

КонецЦикла;

Возврат Структура;

КонецФункции

Функция DecToAny(Знач тЗначение, тОснование)
	
	тРезультат = "";
	
	Пока тЗначение > 0 Цикл
		тРезультат = Сред("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ", тЗначение%тОснование + 1, 1) + тРезультат;
		тЗначение = Цел(тЗначение/тОснование) ;
	КонецЦикла;
	
	Возврат тРезультат;
	
	йцу = "31231231231";	
	///////////////////
	
	
	
КонецФункции